<a href="https://colab.research.google.com/github/nanighi/prep_week3_ip/blob/main/Moringa_Data_Science_Prep_W3_Independent_Project.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
# loading the first data set 
df1= pd.read_csv('/content/Telcom_dataset.csv')
df1.head()

  PRODUCT  VALUE DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0   Voice      0   04:37.0  ...     19e2e  /TJNe+Mmtu  /TJNe+Mmtu
1     sms      0   05:25.0  ...     19e2e  /+cKZKIp41  /+cKZKIp41
2     sms     25   05:41.0  ...     19e2e  /u0FSD+ahi  /u0FSD+ahi
3   Voice     56   05:42.0  ...     19e2e      #NAME?      #NAME?
4   Voice     14   06:29.0  ...     19e2e  051KhYDCpv  051KhYDCpv

[5 rows x 10 columns]

In [ ]:
#checking the shape of df1
df1.shape

(5001, 10)

In [ ]:
#loading the second data set
df2= pd.read_csv('/content/Telcom_dataset2.csv')
df2.head()

  PRODUCT  VALUE DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
0     sms      0   02:06.0  ...     19e2e  +854AcBQT2  +854AcBQT2
1   Voice      0   03:44.0  ...     19e2e  +854AcBQT2  +854AcBQT2
2     sms      0   04:06.0  ...     19e2e      #NAME?      #NAME?
3   Voice     37   04:48.0  ...     19e2e  /xvRrCVKoQ  /xvRrCVKoQ
4     sms     25   04:58.0  ...     19e2e      #NAME?      #NAME?

[5 rows x 10 columns]

In [ ]:
#checking the shape of data frame 2
df2.shape

(5001, 10)

In [ ]:
#loading the third data set
df3= pd.read_csv('/content/Telcom_dataset3.csv')
df3.tail()

     PRODUCT  VALUE DATE_TIME  ... COUNTRY_B     CELL_ID     SITE_ID
4996   Voice      0   01:43.0  ...     19e2e  2aa04dcab7  f7d63a29e5
4997   Voice     62   01:43.0  ...     19e2e  7f1f2f889f  b4ddb9e93c
4998   Voice     32   01:43.0  ...     19e2e  a4731e780e  d68260ef50
4999   Voice     30   01:43.0  ...     19e2e  98ed726da2  b4130b54ab
5000   Voice     60   01:43.0  ...     19e2e  1c11a2fcbb  6d70dae094

[5 rows x 10 columns]

In [ ]:
#checking shape of data frame 3
df3.shape

(5001, 10)

In [ ]:
#loading the cell geo data
cellgeo = pd.read_csv('/content/cells_geo.csv',delimiter=";",index_col=0)
cellgeo

        VILLES      STATUS LOCALISATION  ...          AREA     CELL_ID   SITE_CODE
0       ADJAME  In Service      ABIDJAN  ...           NaN  fbb2e75af3  0bb492ef17
1       ADJAME  In Service      ABIDJAN  ...           NaN  1502501d78  0bb492ef17
2       ADJAME  In Service      ABIDJAN  ...           NaN  0c2e182a0c  0bb492ef17
3      ASSINIE  In Service    INTERIEUR  ...           NaN  69bdfc69fd  8a1e6ce31f
4      ASSINIE  In Service    INTERIEUR  ...           NaN  7a1029d2ab  8a1e6ce31f
...        ...         ...          ...  ...           ...         ...         ...
3969  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  1cfc2d7ab1  f91ed8d2e9
3970  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  3ae1708153  f91ed8d2e9
3971  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  cb71f8a29c  61bee9c70c
3972  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  d4a6a0b645  61bee9c70c
3973  ZUENOULA  In Service    INTERIEUR  ...  CENTRE NORTH  f9f3e42589  61bee9c70c

[3974 rows x 11 columns]

In [ ]:
#loading the cdr  data set description
cdr = pd.read_excel('/content/CDR_description.xlsx')
cdr.head()

       Column name                                        Description   Format
0          PRODUCT                                       Voice or SMS   String
1            VALUE                                      Billing price  Integer
2        DATE_TIME               Time in format yyyy-MM-dd hh:mm:ss.0   String
3     CELL_ON_SITE  Which cell in the site was used (not needed here)  Integer
4  DW_A_NUMBER_INT  Anonymized phone number of the person for whic...   String

In [ ]:
#loading the cell geo description  data set 
cell_geo_descr = pd.read_excel('/content/cells_geo_description.xlsx')
cell_geo_descr.head()

    Column name        Description  Format
0        VILLES               City  String
1        STATUS  In Service or not  String
2  LOCALISATION  in ABIDJAN or not  String
3    DECOUPZONE  Geographical Zone  String
4      ZONENAME       Name of Zone  String

In [ ]:
#concatinating the three data sets

combine_data=pd.concat((df2,df1,df3),ignore_index=1)
combine_data.head(3)

  PRODUCT  VALUE DATE_TIME  ...     CELL_ID     SITE_ID DW_B_NUMBER_INT
0     sms      0   02:06.0  ...  +854AcBQT2  +854AcBQT2             NaN
1   Voice      0   03:44.0  ...  +854AcBQT2  +854AcBQT2             NaN
2     sms      0   04:06.0  ...      #NAME?      #NAME?             NaN

[3 rows x 11 columns]

In [ ]:
# dropping the columns that are not usefull in our analysis
combine_data1 = combine_data.drop(columns=['COUNTRY_A','COUNTRY_B','CELL_ON_SITE'])
combine_data1.head(3)

  PRODUCT  VALUE DATE_TIME  ...     CELL_ID     SITE_ID DW_B_NUMBER_INT
0     sms      0   02:06.0  ...  +854AcBQT2  +854AcBQT2             NaN
1   Voice      0   03:44.0  ...  +854AcBQT2  +854AcBQT2             NaN
2     sms      0   04:06.0  ...      #NAME?      #NAME?             NaN

[3 rows x 8 columns]

In [ ]:
# cumulative products value
# value for voice ,data and sms
products = combine_data1.groupby(['PRODUCT'])['VALUE'].sum()
products

PRODUCT
Voice    312593
data      17287
sms       53427
Name: VALUE, dtype: int64

In [ ]:
# merged data for the 3 data sets and the cell geo data set
all_data=pd.merge(combine_data1, cellgeo, how='inner', left_on=['SITE_ID'], right_on=['SITE_CODE'])
all_data.head(2)

  PRODUCT  VALUE DATE_TIME  ...           AREA   CELL_ID_y   SITE_CODE
0   Voice      0   00:00.0  ...  ABIDJAN NORTH  459145474d  01c428bbac
1   Voice      0   00:00.0  ...  ABIDJAN NORTH  e71fc23da3  01c428bbac

[2 rows x 19 columns]

In [ ]:
#group data by the cities
#shows each city traffic in values
products2 = all_data.groupby(['VILLES'])['VALUE'].sum()
products2

VILLES
ABENGOUROU         8709
ABOBO            125921
ABOISSO            1650
ABOISSO COMOE       795
ABONGOUA              3
                  ...
ZATTA                 3
ZIKISSO             968
ZON-HOUNIEN         363
ZOUKOUGBEU          714
ZUENOULA           3846
Name: VALUE, Length: 398, dtype: int64

In [ ]:
#group data by regions
#shows regions with highest values
pd.value_counts(all_data['REGION'])

LAGUNE               33529
LACS                  2484
BAS SASSANDRA         2395
HAUT SASSANDRA        2313
VALLEE DU BANDAMA     1575
SUD BANDAMA           1533
SAVANE                1014
18 MONTAGNES           957
FROMAGER               916
WORODOUGOU             795
MARAHOUE               621
AGNEBY                 604
NZI COMOE              571
MOYEN CAVALLY          531
DENGUELE               398
ZANZAN                 330
MOYEN COMOE            321
SUD COMOE              208
BAFING                 102
Name: REGION, dtype: int64